; domain
;; Adapted from: https://github.com/josej30/Planner-Sat-Constraints
;; We use existential preconditions (exists) to remove as many parameters from the actions as possible

(define (domain logistics)

(:requirements :strips :typing :existential-preconditions) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location)
         :precondition  (and 
                             (at ?t ?from)
                             (exists (?c - city)
                                (and (in-city ?from ?c) (in-city ?to ?c))
                              )
                         )
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem logistics-c2-s2-p3-a7)

(:domain logistics)

(:objects a0 a1 a2 a3 a4 a5 a6 - airplane
          c0 c1 - city
          t0 t1 t2 t3 - truck
          l0-0 l1-0 - airport
          l0-1 l1-1 - location
          p0 p1 p2 - package
)

(:init
    (in-city  l0-0 c0)
    (in-city  l0-1 c0)
    (in-city  l1-0 c1)
    (in-city  l1-1 c1)
    (at t0 l0-0)
    (at t1 l1-1)
    (at t2 l1-1)
    (at t3 l0-0)
    (at p0 l0-1)
    (at p1 l1-0)
    (at p2 l0-1)
    (at a0 l1-0)
    (at a1 l0-0)
    (at a2 l0-0)
    (at a3 l1-0)
    (at a4 l1-0)
    (at a5 l0-0)
    (at a6 l1-0)
)

(:goal
    (and
        (at p0 l1-1)
        (at p1 l1-1)
        (at p2 l1-1)
    )
)
)

; plan
1. (drive t0 l0-0 l0-1)
   deleted: (at t0 l0-0)
   added: (at t0 l0-1)
   goals met: 0 of 3
2. (drive t3 l0-0 l0-1)
   deleted: (at t3 l0-0)
   added: (at t3 l0-1)
   goals met: 0 of 3
3. (fly a1 l0-0 l1-0)
   deleted: (at a1 l0-0)
   added: (at a1 l1-0)
   goals met: 0 of 3
4. (load a3 p1 l1-0)
   deleted: (at p1 l1-0)
   added: (in p1 a3)
   goals met: 0 of 3
5. (fly a3 l1-0 l0-0)
   deleted: (at a3 l1-0)
   added: (at a3 l0-0)
   goals met: 0 of 3
6. (drive t2 l1-1 l1-0)
   deleted: (at t2 l1-1)
   added: (at t2 l1-0)
   goals met: 0 of 3
7. (drive t3 l0-1 l0-0)
   deleted: (at t3 l0-1)
   added: (at t3 l0-0)
   goals met: 0 of 3
8. (fly a0 l1-0 l0-0)
   deleted: (at a0 l1-0)
   added: (at a0 l0-0)
   goals met: 0 of 3
9. (load t0 p0 l0-1)
   deleted: (at p0 l0-1)
   added: (in p0 t0)
   goals met: 0 of 3
10. (load t0 p2 l0-1)
   deleted: (at p2 l0-1)
   added: (in p2 t0)
   goals met: 0 of 3
11. (unload a3 p1 l0-0)
   deleted: (in p1 a3)
   added: (at p1 l0-0)
   goals met: 0 of 3
12. (drive t0 l0-1 l0-0)
   deleted: (at t0 l0-1)
   added: (at t0 l0-0)
   goals met: 0 of 3
13. (fly a1 l1-0 l0-0)
   deleted: (at a1 l1-0)
   added: (at a1 l0-0)
   goals met: 0 of 3
14. (fly a2 l0-0 l1-0)
   deleted: (at a2 l0-0)
   added: (at a2 l1-0)
   goals met: 0 of 3
15. (fly a4 l1-0 l0-0)
   deleted: (at a4 l1-0)
   added: (at a4 l0-0)
   goals met: 0 of 3
16. (load a0 p1 l0-0)
   deleted: (at p1 l0-0)
   added: (in p1 a0)
   goals met: 0 of 3
17. (unload t0 p0 l0-0)
   deleted: (in p0 t0)
   added: (at p0 l0-0)
   goals met: 0 of 3
18. (unload t0 p2 l0-0)
   deleted: (in p2 t0)
   added: (at p2 l0-0)
   goals met: 0 of 3
19. (drive t0 l0-0 l0-1)
   deleted: (at t0 l0-0)
   added: (at t0 l0-1)
   goals met: 0 of 3
20. (drive t1 l1-1 l1-0)
   deleted: (at t1 l1-1)
   added: (at t1 l1-0)
   goals met: 0 of 3
21. (fly a1 l0-0 l1-0)
   deleted: (at a1 l0-0)
   added: (at a1 l1-0)
   goals met: 0 of 3
22. (fly a2 l1-0 l0-0)
   deleted: (at a2 l1-0)
   added: (at a2 l0-0)
   goals met: 0 of 3
23. (fly a3 l0-0 l1-0)
   deleted: (at a3 l0-0)
   added: (at a3 l1-0)
   goals met: 0 of 3
24. (fly a4 l0-0 l1-0)
   deleted: (at a4 l0-0)
   added: (at a4 l1-0)
   goals met: 0 of 3
25. (fly a6 l1-0 l0-0)
   deleted: (at a6 l1-0)
   added: (at a6 l0-0)
   goals met: 0 of 3
26. (load a0 p0 l0-0)
   deleted: (at p0 l0-0)
   added: (in p0 a0)
   goals met: 0 of 3
27. (load a0 p2 l0-0)
   deleted: (at p2 l0-0)
   added: (in p2 a0)
   goals met: 0 of 3
28. (fly a0 l0-0 l1-0)
   deleted: (at a0 l0-0)
   added: (at a0 l1-0)
   goals met: 0 of 3
29. (drive t1 l1-0 l1-1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-1)
   goals met: 0 of 3
30. (drive t3 l0-0 l0-1)
   deleted: (at t3 l0-0)
   added: (at t3 l0-1)
   goals met: 0 of 3
31. (fly a1 l1-0 l0-0)
   deleted: (at a1 l1-0)
   added: (at a1 l0-0)
   goals met: 0 of 3
32. (fly a2 l0-0 l1-0)
   deleted: (at a2 l0-0)
   added: (at a2 l1-0)
   goals met: 0 of 3
33. (fly a3 l1-0 l0-0)
   deleted: (at a3 l1-0)
   added: (at a3 l0-0)
   goals met: 0 of 3
34. (fly a5 l0-0 l1-0)
   deleted: (at a5 l0-0)
   added: (at a5 l1-0)
   goals met: 0 of 3
35. (drive t1 l1-1 l1-0)
   deleted: (at t1 l1-1)
   added: (at t1 l1-0)
   goals met: 0 of 3
36. (drive t2 l1-0 l1-1)
   deleted: (at t2 l1-0)
   added: (at t2 l1-1)
   goals met: 0 of 3
37. (fly a2 l1-0 l0-0)
   deleted: (at a2 l1-0)
   added: (at a2 l0-0)
   goals met: 0 of 3
38. (fly a5 l1-0 l0-0)
   deleted: (at a5 l1-0)
   added: (at a5 l0-0)
   goals met: 0 of 3
39. (fly a6 l0-0 l1-0)
   deleted: (at a6 l0-0)
   added: (at a6 l1-0)
   goals met: 0 of 3
40. (drive t0 l0-1 l0-0)
   deleted: (at t0 l0-1)
   added: (at t0 l0-0)
   goals met: 0 of 3
41. (drive t1 l1-0 l1-1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-1)
   goals met: 0 of 3
42. (drive t2 l1-1 l1-0)
   deleted: (at t2 l1-1)
   added: (at t2 l1-0)
   goals met: 0 of 3
43. (drive t3 l0-1 l0-0)
   deleted: (at t3 l0-1)
   added: (at t3 l0-0)
   goals met: 0 of 3
44. (fly a1 l0-0 l1-0)
   deleted: (at a1 l0-0)
   added: (at a1 l1-0)
   goals met: 0 of 3
45. (fly a2 l0-0 l1-0)
   deleted: (at a2 l0-0)
   added: (at a2 l1-0)
   goals met: 0 of 3
46. (fly a4 l1-0 l0-0)
   deleted: (at a4 l1-0)
   added: (at a4 l0-0)
   goals met: 0 of 3
47. (fly a5 l0-0 l1-0)
   deleted: (at a5 l0-0)
   added: (at a5 l1-0)
   goals met: 0 of 3
48. (drive t3 l0-0 l0-1)
   deleted: (at t3 l0-0)
   added: (at t3 l0-1)
   goals met: 0 of 3
49. (fly a1 l1-0 l0-0)
   deleted: (at a1 l1-0)
   added: (at a1 l0-0)
   goals met: 0 of 3
50. (fly a3 l0-0 l1-0)
   deleted: (at a3 l0-0)
   added: (at a3 l1-0)
   goals met: 0 of 3
51. (fly a5 l1-0 l0-0)
   deleted: (at a5 l1-0)
   added: (at a5 l0-0)
   goals met: 0 of 3
52. (fly a6 l1-0 l0-0)
   deleted: (at a6 l1-0)
   added: (at a6 l0-0)
   goals met: 0 of 3
53. (unload a0 p0 l1-0)
   deleted: (in p0 a0)
   added: (at p0 l1-0)
   goals met: 0 of 3
54. (unload a0 p1 l1-0)
   deleted: (in p1 a0)
   added: (at p1 l1-0)
   goals met: 0 of 3
55. (unload a0 p2 l1-0)
   deleted: (in p2 a0)
   added: (at p2 l1-0)
   goals met: 0 of 3
56. (drive t0 l0-0 l0-1)
   deleted: (at t0 l0-0)
   added: (at t0 l0-1)
   goals met: 0 of 3
57. (drive t1 l1-1 l1-0)
   deleted: (at t1 l1-1)
   added: (at t1 l1-0)
   goals met: 0 of 3
58. (drive t3 l0-1 l0-0)
   deleted: (at t3 l0-1)
   added: (at t3 l0-0)
   goals met: 0 of 3
59. (fly a0 l1-0 l0-0)
   deleted: (at a0 l1-0)
   added: (at a0 l0-0)
   goals met: 0 of 3
60. (fly a3 l1-0 l0-0)
   deleted: (at a3 l1-0)
   added: (at a3 l0-0)
   goals met: 0 of 3
61. (fly a4 l0-0 l1-0)
   deleted: (at a4 l0-0)
   added: (at a4 l1-0)
   goals met: 0 of 3
62. (load t2 p0 l1-0)
   deleted: (at p0 l1-0)
   added: (in p0 t2)
   goals met: 0 of 3
63. (load t2 p1 l1-0)
   deleted: (at p1 l1-0)
   added: (in p1 t2)
   goals met: 0 of 3
64. (load t2 p2 l1-0)
   deleted: (at p2 l1-0)
   added: (in p2 t2)
   goals met: 0 of 3
65. (drive t2 l1-0 l1-1)
   deleted: (at t2 l1-0)
   added: (at t2 l1-1)
   goals met: 0 of 3
66. (drive t1 l1-0 l1-1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-1)
   goals met: 0 of 3
67. (drive t3 l0-0 l0-1)
   deleted: (at t3 l0-0)
   added: (at t3 l0-1)
   goals met: 0 of 3
68. (fly a0 l0-0 l1-0)
   deleted: (at a0 l0-0)
   added: (at a0 l1-0)
   goals met: 0 of 3
69. (fly a1 l0-0 l1-0)
   deleted: (at a1 l0-0)
   added: (at a1 l1-0)
   goals met: 0 of 3
70. (fly a2 l1-0 l0-0)
   deleted: (at a2 l1-0)
   added: (at a2 l0-0)
   goals met: 0 of 3
71. (fly a3 l0-0 l1-0)
   deleted: (at a3 l0-0)
   added: (at a3 l1-0)
   goals met: 0 of 3
72. (fly a6 l0-0 l1-0)
   deleted: (at a6 l0-0)
   added: (at a6 l1-0)
   goals met: 0 of 3
73. (unload t2 p0 l1-1)
   deleted: (in p0 t2)
   added: (at p0 l1-1)
   goals met: 1 of 3
74. (unload t2 p1 l1-1)
   deleted: (in p1 t2)
   added: (at p1 l1-1)
   goals met: 2 of 3
75. (unload t2 p2 l1-1)
   deleted: (in p2 t2)
   added: (at p2 l1-1)
   goals met: 3 of 3
